{"config": [{"config": {"strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 32, "dtype": "float32", "name": "conv2d_1", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "filters": 64, "name": "conv2d_2", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "units": 128, "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "units": 10, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.5"}