{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 128, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"activation": "softmax", "name": "dense_2", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true, "units": 10, "bias_regularizer": null}}]}