{"backend": "tensorflow", "keras_version": "2.0.6", "config": [{"config": {"filters": 32, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "dtype": "float32", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"filters": 64, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 128, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 10, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}